Revit 2027 API
BuiltInFailures.MEPFabricationFailures.InvalidConnectionsHaveBeenDisconnected Property
 Invalid connections have been disconnected. Please reconnect them manually or use different fittings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidConnectionsHaveBeenDisconnected { get; }
Public Shared ReadOnly Property InvalidConnectionsHaveBeenDisconnected As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidConnectionsHaveBeenDisconnected {
	FailureDefinitionId^ get ();
}
static member InvalidConnectionsHaveBeenDisconnected : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace